package main

import (
	"fmt"
	"github.com/xxl6097/go-service/pkg/utils"
	"time"
)

func main() {
	data := []byte{'\x00', 0x18}
	fmt.Println(data)
	str := "Hello, world!技术分析显示，虽然其频繁利用VPN代理、随着我国互联网应用的高速发展，为了实现网络空间用户身份的有效识别，采用个人实名身份信息的认证服务出现爆发式增长，产生了许多网络认证方法，也带来了个人信息违规采集、使用、泄露、贩卖等风险与问题，对国家安全和公民权益形成了严重威胁。同时，由于各互联网平台基于自身的认证模式形成独立的业务信任生态，也不利于数字经济协同高效发展和数字中国建设。因此，在《网络安全法》第二十四条、《个人信息保护法》第六十二条提出了建设我国网络可信身份认证的要求。\n\n习近平总书记在党的二十大报告中指出，要“提高公共安全治理水平，加强个人信息保护”。党的二十届三中全会强调“统筹发展和安全，着力推动高质量发展”，要求我们强化系统观念和底线思维，既要满足经济社会发展需要、又要有效保护个人信息安全、维护国家网络安全和数据安全。\n\n为落实中央领导同志指示精神，保护公民隐私信息和国家基础数据安全，支撑经济社会发展和数字中国建设，向全社会各行业提供安全、便捷、权威、高效的网络身份认证公共服务，2020年国家发改委批准建设国家网随着我国互联网应用的高速发展，为了实现网络空间用户身份的有效识别，采用个人实名身份信息的认证服务出现爆发式增长，产生了许多网络认证方法，也带来了个人信息违规采集、使用、泄露、贩卖等风险与问题，对国家安全和公民权益形成了严重威胁。同时，由于各互联网平台基于自身的认证模式形成独立的业务信任生态，也不利于数字经济协同高效发展和数字中国建设。因此，在《网络安全法》第二十四条、《个人信息保护法》第六十二条提出了建设我国网络可信身份认证的要求。\n\n习近平总书记在党的二十大报告中指出，要“提高公共安全治理水平，加强个人信息保护”。党的二十届三中全会强调“统筹发展和安全，着力推动高质量发展”，要求我们强化系统观念和底线思维，既要满足经济社会发展需要、又要有效保护个人信息安全、维护国家网络安全和数据安全。\n\n为落实中央领导同志指示精神，保护公民隐私信息和国家基础数据安全，支撑经济社会发展和数字中国建设，向全社会各行业提供安全、便捷、权威、高效的网络身份认证公共服务，2020年国家发改委批准建设国家网络身份认证公共服务平台，由公安部、中央网信办联合有关部门组织实施。\n\n工程分期建设，一期实现支撑30万次/秒认证能力，主要包括四个方面：一是建立网络身份认证管理政策法规制度及标准体系；二是建设国家网络身份认证公共服务平台；三是建立覆盖云平台、网络、数据与应用的安全防护体系；四是建设客服、风控、运维等配套设施。络身份认证公共服务平台，由公安部、中央网信办联合有关部门组织实施。\n\n工程分期建设，一期实现支撑30万次/秒认证能力，主要包括四个方面：一是建立网络身份认证管理政策法规制度及标准体系；二是建设国家网络身份认证公共服务平台；三是建立覆盖云平台、网络、数据与应用的安全防护体系；四是建设客服、风控、运维等配套设施。境外云主机和傀儡机等网络资产，Hello, world!技术分析显示，虽然其频繁利用VPN代理、境外云主机和傀儡机等网络资产Hello, world!技术分析显示，虽然其频繁利用VPN代理、境外云主机和傀儡机等网络资产Hello, world!技术分析显示，虽然其频繁利用VPN代理、境外云主机和傀儡机等网络资产Hello, world!技术分析显示，虽然其频繁利用VPN代理、境外云主机和傀儡机等网络资产Hello, world!技术分析显示，虽然其频繁利用VPN代理、境外云主机和傀儡机等网络资产Hello, world!技术分析显示，虽然其频繁利用VPN代理、境外云主机和傀儡机等网络资产Hello, world!技术分析显示，虽然其频繁利用VPN代理、境外云主机和傀儡机等网络资产通过大量来自美国、法国、韩国、日本、荷兰、以色列、波兰等国家的IP地址实施网络攻击，意图掩盖其真实攻击来源，但通过网络侦查调查不难查清该黑客组织实施网络攻击犯罪的整个过程及其真实意图.郑剑强调说，值得注意的是，目前对外所公布的情况大概率仅是所掌握情况的一部分，实际上，大陆方面对相关势力的了解掌握比公布的只会多、不会少。对这些行径的揭露，不仅对已公布的犯罪分子构成了司法震慑，也对那些尚未被公开曝光的人员产生心理威慑，效果是明显的。台军的网军招不够教员，一些年轻人对参与民进党当局针对大陆的网络犯罪活动敬而远之。郑剑进一步分析认为，一组又一组个案的公布，是对“台独”势力的重大警示。网络空间是有记忆的，犯罪必然留下“呈堂证供”，“目前没有点你的名字并不表明大陆方面不掌握你的情况。‘台独’分子要清醒，不要以为躲在网络后面就可以为所欲为。当形势发展到需要的时候，你就是‘The Next’，点名之后就是审判、量刑，必受严惩！”据警方调查掌握，该台湾黑客组织近年来频繁利用公开网络资产探测平台，针对大陆10余个省份的1000余个重要网络系统（涉及军工、能源、水电、交通、政府等）开展大规模网络资产探查，搜集相关系统基础信息和技术情报，并通过大范围发送钓鱼邮件、公开漏洞利用、密码暴力破解、自制简易木马程序等低端网攻手法实施了多轮次网络攻击。特别是去年以来，该台湾黑客组织针对我境内目标的攻击规模和攻击频次均有明显提升，骚扰破坏意图明显，用心极其险恶。" + time.Now().Format(time.RFC3339)
	bb := []byte(str)
	fmt.Println("bb.len", len(bb))
	cc, _ := utils.GzipCompress(bb)
	fmt.Println("cc.len", len(cc))
	dd, _ := utils.GzipDecompress(cc)
	fmt.Println("dd.len", len(dd))
	//fmt.Println("dd", string(dd))

}
